app/controllers/boards_controller.rb

  def index
    @boards = params[:tag_id].present? ? Tag.find(params[:tag_id]).boards : Board.all
    @boards = @boards.page(params[:page]) #pageはkaminariのメソッド
---
SELECT  `boards`.* FROM `boards` LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `boards`

  def create
    board = Board.new(board_params)
    if board.save
---
INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('syo', 'Ruby on Railsについて学びたい方募集', 'Railsについて学びたい方\r\n募集します', '2021-03-09 06:25:24', '2021-03-09 06:25:24')

  def update
    board = Board.new(board_params)
    if board.save
      flash[:notice] = "「#{board.title}」の掲示板を編集しました"
      @board.update(board_params)
---
UPDATE `boards` SET `name` = 'syoo', `title` = 'Reactについて学びたい方募集', `body` = 'Reactについて学びたい方\r\n募集します', `updated_at` = '2021-03-09 07:33:12' WHERE `boards`.`id` = 1

  def destroy
    @board.destroy
---
DELETE FROM `boards` WHERE `boards`.`id` = 4

  def set_target_board
    @board = Board.find(params[:id])
---
SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 4 LIMIT 1